In [1]:
import numpy as np
import pandas as pd

### Series

In [2]:
labels = ["a", "b", "c"]

In [3]:
mylist = [10, 20, 30]

In [4]:
arr = np.array(mylist)

In [5]:
arr

array([10, 20, 30])

In [6]:
d = {'a': 10, 'b': 20, 'c': 30}

In [7]:
np.array(d)

array({'a': 10, 'b': 20, 'c': 30}, dtype=object)

In [8]:
pd.Series(mylist)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [11]:
pd.Series(data=mylist, index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
ser1 = pd.Series(data=["Ottoman", "South Africa",
                 "South Korea"], index=[1, 2, 3])

In [13]:
ser1

1         Ottoman
2    South Africa
3     South Korea
dtype: object

In [14]:
ser1[1]

'Ottoman'

In [15]:
ser2 = pd.Series(data=[5, 6, 7, 8], index=["Morocco",
                 "Turkmenistan", "Kazakistan", "Qatar"])

In [16]:
ser2

Morocco         5
Turkmenistan    6
Kazakistan      7
Qatar           8
dtype: int64

In [17]:
ser1 + ser2

1               NaN
2               NaN
3               NaN
Kazakistan      NaN
Morocco         NaN
Qatar           NaN
Turkmenistan    NaN
dtype: object

### DataFrames

In [18]:
from numpy.random import randn
np.random.seed(101)

rand_mat = randn(5, 4)
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [19]:
df = pd.DataFrame(data=rand_mat, index="A B C D E".split(), columns="W X Y Z".split())

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### grab the data from df

In [21]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [22]:
type(df["W"])

pandas.core.series.Series

In [23]:
desired_list = ["X", "Y"]

In [24]:
df[desired_list]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [25]:
df[["X", "Y"]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [26]:
df.W # this is not recommended

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

#### add a new column to exist DataFrame

In [27]:
df["Q"] = df["W"] + df["Y"]

In [28]:
df

          W         X         Y         Z         Q
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

#### remove the column

In [29]:
df.drop("Q", axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df

          W         X         Y         Z         Q
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [31]:
df.drop("Q", axis=1, inplace=True)

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### rows

In [33]:
df.drop("C")

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.loc["A"]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [36]:
df.loc[["A"]]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

#### integer location

In [37]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [38]:
df.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [39]:
df.iloc[0:2]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [40]:
df.loc[["B", "E"]]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
E  0.190794  1.978757  2.605967  0.683509

#### subset of the data

In [41]:
df.loc[['A', "B"]][["Y","Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [42]:
df.loc[['A', "B"], ["Y","Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

### Dataframes - Part Two

In [43]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [44]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df["W"] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [47]:
df[df["W"] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df[df["W"] > 0][["Y"]]

          Y
A  0.907969
B -0.848077
D -0.933237
E  2.605967

In [49]:
df[df["W"] > 0][["Y"]].loc["A"]

Y    0.907969
Name: A, dtype: float64

#### multiple conditions

In [50]:
cond1 = df["W"] > 0
cond2 = df["Y"] > 1

In [51]:
df[cond1 and cond2]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [52]:
df[(cond1) & (cond2)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

#### reset and set index

In [53]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [54]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
new_ind = "IST ANK KON ERZ URF".split()

In [69]:
new_ind

['IST', 'ANK', 'KON', 'ERZ', 'URF']

In [70]:
df["States"] = new_ind

In [71]:
df

               W         X         Y         Z States
States
IST     2.706850  0.628133  0.907969  0.503826    IST
ANK     0.651118 -0.319318 -0.848077  0.605965    ANK
KON    -2.018168  0.740122  0.528813 -0.589001    KON
ERZ     0.188695 -0.758872 -0.933237  0.955057    ERZ
URF     0.190794  1.978757  2.605967  0.683509    URF

In [72]:
df.set_index("States", inplace=True)

In [73]:
df

               W         X         Y         Z
States
IST     2.706850  0.628133  0.907969  0.503826
ANK     0.651118 -0.319318 -0.848077  0.605965
KON    -2.018168  0.740122  0.528813 -0.589001
ERZ     0.188695 -0.758872 -0.933237  0.955057
URF     0.190794  1.978757  2.605967  0.683509

#### get df informations

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, IST to URF
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [75]:
df.head()

               W         X         Y         Z
States
IST     2.706850  0.628133  0.907969  0.503826
ANK     0.651118 -0.319318 -0.848077  0.605965
KON    -2.018168  0.740122  0.528813 -0.589001
ERZ     0.188695 -0.758872 -0.933237  0.955057
URF     0.190794  1.978757  2.605967  0.683509

In [76]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [77]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

#### several tricks

In [78]:
df

               W         X         Y         Z
States
IST     2.706850  0.628133  0.907969  0.503826
ANK     0.651118 -0.319318 -0.848077  0.605965
KON    -2.018168  0.740122  0.528813 -0.589001
ERZ     0.188695 -0.758872 -0.933237  0.955057
URF     0.190794  1.978757  2.605967  0.683509

In [79]:
ser_w = df["W"] > 0

In [80]:
ser_w.value_counts()

W
True     4
False    1
Name: count, dtype: int64

In [81]:
sum(ser_w)

4

In [82]:
len(ser_w)

5

### Missing Data

Missing Data has only three options:
1. Keep the missing data(NaN), if the forecasting method can handle it.
2. Drop the missing data(the entire row including the timestamp)
3. Fill in the missing data with some value(best estimated guess)

In [86]:
new_dff = pd.DataFrame(
    data=[[0, 1, 2], ["a", "b", "c"]],
    index="first second".split(),
    columns=["ilk", "ikinci", "ucuncu"]
)
new_dff

       ilk ikinci ucuncu
first    0      1      2
second   a      b      c

In [83]:
dff = pd.DataFrame({"A": [1, 2, np.nan], "B": [
                   5, np.nan, np.nan], "C": [1, 2, 3]})

In [84]:
dff

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [87]:
dff.dropna()

     A    B  C
0  1.0  5.0  1

In [90]:
dff.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [91]:
dff.fillna(value="FILL VALUE")

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [92]:
dff.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [93]:
dff.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [94]:
dff.fillna(dff.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [95]:
dff

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [96]:
dff["A"]

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [97]:
dff["A"].mean()

1.5

In [98]:
dff["A"].fillna(value=dff["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Group operations

Group By operations involve:
- Split
- Apply
- Combine

In [99]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales': [200, 120, 340, 124, 243, 350],
        "RevenueperYear(Billion$)": [50, 70, 40, 45, 89, 90]}

In [100]:
data_f = pd.DataFrame(data=data)

In [101]:
data_f

  Company   Person  Sales  RevenueperYear(Billion$)
0    GOOG      Sam    200                        50
1    GOOG  Charlie    120                        70
2    MSFT      Amy    340                        40
3    MSFT  Vanessa    124                        45
4      FB     Carl    243                        89
5      FB    Sarah    350                        90

In [102]:
data_f.groupby("Company")

In [103]:
data_f.groupby("Company").sum()

             Person  Sales  RevenueperYear(Billion$)
Company
FB        CarlSarah    593                       179
GOOG     SamCharlie    320                       120
MSFT     AmyVanessa    464                        85

In [104]:
data_f.groupby("Company").describe()

        Sales                                                          \
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

        RevenueperYear(Billion$)                                             \
                           count  mean        std   min    25%   50%    75%
Company
FB                           2.0  89.5   0.707107  89.0  89.25  89.5  89.75
GOOG                         2.0  60.0  14.142136  50.0  55.00  60.0  65.00
MSFT                         2.0  42.5   3.535534  40.0  41.25  42.5  43.75


          max
Company
FB       90.0
GOOG     70.0
MSFT     45.0

In [105]:
data_f.groupby("Company").describe().transpose()

Company                                 FB        GOOG        MSFT
Sales                    count    2.000000    2.000000    2.000000
                         mean   296.500000  160.000000  232.000000
                         std     75.660426   56.568542  152.735065
                         min    243.000000  120.000000  124.000000
                         25%    269.750000  140.000000  178.000000
                         50%    296.500000  160.000000  232.000000
                         75%    323.250000  180.000000  286.000000
                         max    350.000000  200.000000  340.000000
RevenueperYear(Billion$) count    2.000000    2.000000    2.000000
                         mean    89.500000   60.000000   42.500000
                         std      0.707107   14.142136    3.535534
                         min     89.000000   50.000000   40.000000
                         25%     89.250000   55.000000   41.250000
                         50%     89.500000   60.000000   42.500000
                         75%     89.750000   65.000000   43.750000
                         max     90.000000   70.000000   45.000000

### Operations

In [106]:
df = pd.DataFrame({'col1': [1, 2, 3, 4], 'col2': [
                  444, 555, 666, 444], 'col3': ['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [111]:
cols = ["col1", "col2", "col3", "col4"]
data = [
    [1, 200, 3, 4],
    [10, 20, 30, 40],
    [100, 200, 300, 400],
    ["a", "bb", "ccc", "dddd"]
]

dataf = pd.DataFrame(data=data, columns=cols, index=[0, 1, 2, 3])
dataf

  col1 col2 col3  col4
0    1  200    3     4
1   10   20   30    40
2  100  200  300   400
3    a   bb  ccc  dddd

In [112]:
dataf["col2"].unique()

array([200, 20, 'bb'], dtype=object)

In [113]:
dataf["col2"].nunique()

3

In [114]:
dataf["col2"].value_counts()

col2
200    2
20     1
bb     1
Name: count, dtype: int64

#### apply function

In [138]:
newdf = df[(df["col1"] > 2) | (df["col2"] == 200)]
newdf

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [139]:
def times_two(number):
    return number * 2

In [140]:
times_two(5)

10

In [141]:
newdf.apply(times_two)

   col1  col2    col3
2     6  1332  ghighi
3     8   888  xyzxyz

In [142]:
newdf["col1"].apply(times_two)

2    6
3    8
Name: col1, dtype: int64

In [143]:
newdf["results col1"] = newdf["col1"].apply(times_two).copy(deep=True)

/tmp/ipykernel_115484/1220118273.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf["results col1"] = newdf["col1"].apply(times_two).copy(deep=True)

In [144]:
newdf

   col1  col2 col3  results col1
2     3   666  ghi             6
3     4   444  xyz             8

In [145]:
del newdf["results col1"]

In [146]:
newdf

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [147]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [148]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [149]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [150]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [151]:
df.dtypes

col1     int64
col2     int64
col3    object
dtype: object

In [152]:
df.sort_values("col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [153]:
df.sort_values("col2", ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

### Data Input And Output

#### read and save csv file

In [163]:
sample_data = "~/works/udemy-courses/python-for-time-series-data-analysis/Datas/example.csv"

In [164]:
csv_data = pd.read_csv(sample_data)
csv_data

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [165]:
to_save = csv_data[["a", "b"]]
to_save

    a   b
0   0   1
1   4   5
2   8   9
3  12  13

In [166]:
to_save.to_csv("Datas/my_new_csv_file.csv", index=False)

#### read excel file

In [176]:
excel_data = "~/works/udemy-courses/python-for-time-series-data-analysis/Datas/Excel_Sample.xlsx"

In [ ]:
pd.read_excel(excel_data, sheet_name="Sheet1")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [170]:
!pip install openpyxl

In [178]:
df_excel = pd.read_excel(excel_data, sheet_name="Sheet1")
df_excel

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [181]:
df_excel.drop("Unnamed: 0", axis=1)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### read html page

In [187]:
html_link = 'https://www.fdic.gov/bank-failures/failed-bank-list'

In [188]:
df_html = pd.read_html(html_link)

URLError: <urlopen error [SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate in certificate chain (_ssl.c:1133)>

In [189]:
!pip install lxml

Requirement already satisfied: lxml in /home/ibrahim/anaconda3/envs/tasks/lib/python3.9/site-packages (6.0.2)

In [191]:
df_html = pd.read_html(html_link)

URLError: <urlopen error [SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self-signed certificate in certificate chain (_ssl.c:1133)>

In [193]:
import ssl
import urllib.request

ssl._create_default_https_context = ssl._create_unverified_context

df_html = pd.read_html(html_link)

In [194]:
df_html

[                                            Bank Name                City  \
 0                        The Santa Anna National Bank          Santa Anna
 1                                Pulaski Savings Bank             Chicago
 2                  The First National Bank of Lindsay             Lindsay
 3               Republic First Bank dba Republic Bank        Philadelphia
 4                                       Citizens Bank            Sac City
 5                            Heartland Tri-State Bank             Elkhart
 6                                 First Republic Bank       San Francisco
 7                                      Signature Bank            New York
 8                                 Silicon Valley Bank         Santa Clara
 9                                   Almena State Bank              Almena
 10                         First City Bank of Florida   Fort Walton Beach
 11                               The First State Bank       Barboursville
 12                                 Ericson State Bank             Ericson
 13                   City National Bank of New Jersey              Newark
 14                                      Resolute Bank              Maumee
 15                              Louisa Community Bank              Louisa
 16                               The Enloe State Bank              Cooper
 17                Washington Federal Bank for Savings             Chicago
 18    The Farmers and Merchants State Bank of Argonia             Argonia
 19                                Fayette County Bank          Saint Elmo
 20  Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 21                                     First NBC Bank         New Orleans
 22                                      Proficio Bank  Cottonwood Heights
 23                      Seaway Bank and Trust Company             Chicago
 24                             Harvest Community Bank          Pennsville

             State   Cert                Acquiring Institution  \
 0           Texas   5520            Coleman County State Bank
 1        Illinois  28611                      Millennium Bank
 2        Oklahoma   4134               First Bank & Trust Co.
 3    Pennsylvania  27332    Fulton Bank, National Association
 4            Iowa   8758            Iowa Trust & Savings Bank
 5          Kansas  25851               Dream First Bank, N.A.
 6      California  59017            JPMorgan Chase Bank, N.A.
 7        New York  57053                  Flagstar Bank, N.A.
 8      California  24735  First Citizens Bank & Trust Company
 9          Kansas  15426                          Equity Bank
 10        Florida  16748            United Fidelity Bank, fsb
 11  West Virginia  14361                       MVB Bank, Inc.
 12       Nebraska  18265           Farmers and Merchants Bank
 13     New Jersey  21111                      Industrial Bank
 14           Ohio  58317                   Buckeye State Bank
 15       Kentucky  58112    Kentucky Farmers Bank Corporation
 16          Texas  10716                   Legend Bank, N. A.
 17       Illinois  30570                   Royal Savings Bank
 18         Kansas  17719                          Conway Bank
 19       Illinois   1802            United Fidelity Bank, fsb
 20      Wisconsin  30003  First-Citizens Bank & Trust Company
 21      Louisiana  58302                         Whitney Bank
 22           Utah  35495                    Cache Valley Bank
 23       Illinois  19328                  State Bank of Texas
 24     New Jersey  34951  First-Citizens Bank & Trust Company

          Closing Date  Fund  Sort ascending
 0       June 27, 2025                 10549
 1    January 17, 2025                 10548
 2    October 18, 2024                 10547
 3      April 26, 2024                 10546
 4    November 3, 2023                 10545
 5       July 28, 2023                 10544
 6         May 1, 2023                 10543
 7      March 12, 2023                 10540
 8      March 10, 2023                 10539
 9    October 23, 2020                 10538
 10   October 16, 2020                 10537
 11      April 3, 2020                 10536
 12  February 14, 2020                 10535
 13   November 1, 2019                 10534
 14   October 25, 2019                 10533
 15   October 25, 2019                 10532
 16       May 31, 2019                 10531
 17  December 15, 2017                 10530
 18   October 13, 2017                 10529
 19       May 26, 2017                 10528
 20        May 5, 2017                 10527
 21     April 28, 2017                 10526
 22      March 3, 2017                 10525
 23   January 27, 2017                 10524
 24   January 13, 2017                 10523  ]

In [195]:
type(df_html)

list

In [196]:
len(df_html)

1

In [197]:
html_df = df_html[0]

In [198]:
html_df

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
10,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
11,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
12,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
13,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
14,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
15,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
16,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
17,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
18,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
19,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
20,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
21,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
22,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
23,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524
24,Harvest Community Bank,Pennsville,New Jersey,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523